[AHW_AA_Terror X2MissionTemplate]
DisplayName="围攻：避难所大屠杀"
Briefing="一群抵抗组织特工试图破坏一个ADVENT黑区的行动失败，引发了长老们对作为他们行动基地的避难所的无情愤怒。我们需要尽可能营救平民人员……愿上帝保佑其他人."
PostMissionType="围攻：避难所大屠杀"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="尽可能消灭避难所突击部队."
ObjectiveTextPools[1]="在为时已晚之前营救关键平民人员."
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[AHW_AA_Terror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="从大屠杀中至少救出6名平民"
ObjectiveTextPools[1]="消灭避难所突击部队"
ObjectiveTextPools[2]="撤离任何幸存的XCOM特工"

[AHW_AA_ChosenAvengerDefense X2MissionTemplate]
DisplayName="围攻：复仇者号突袭"
Briefing="天选者动员了一支压倒性的庞大攻击部队，试图打击XCOM项目的核心。复仇者号受损严重，我们寡不敌众，火力也处于劣势。失败不是选项."
PostMissionType="围攻：复仇者号突袭"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="不惜一切代价在被选者的复仇者号围攻中生存下来."

[AHW_AA_ChosenAvengerDefense X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="摧毁所有瞄准复仇者号的炮塔"
ObjectiveTextPools[1]="摧毁围攻大炮的发电机"
ObjectiveTextPools[2]="在天选者的复仇者号围攻中生存下来，并消灭所有敌对部队."